app/views/articles/show.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 2]]
---
  <%= button_to "Upvote", vote_path, params: {:id => @article.id}, method: :post, class: "" %>
  <%= @article.votes.count %>