app/helpers/application_helper.rb

  def logged_in_user
    if current_user.nil?
      'Welcome'
    else
      User.find_by_id(session[:user_id]).name.to_s
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]