app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC
SELECT "categories".* FROM "categories"
---
  def index
    @articles = Article.all.most_recent_by_category

SELECT "categories".* FROM "categories"
SELECT "categories"."name", "categories"."id" FROM "categories"
---
  def new
    @article = Article.new
    @categories = Category.all
    @categoriesSelect = @categories.pluck(:name, :id)

INSERT INTO "articles" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT "categories"."name", "categories"."id" FROM "categories"
---
  def create
    @article = current_user.articles.build(article_params)

    if @article.save
      flash.now[:success] = 'Article created'
      redirect_to article_path(@article)
    else
      @categories = Category.all
      @categoriesSelect = @categories.pluck(:name, :id)

UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "Probably caused by the intense heat waves that have rocked New York City"], ["updated_at", "2021-05-26 01:38:17.226443"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    @article = current_user.articles.find(params[:id])