app/controllers/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT "categories".* FROM "categories" ORDER BY created_at ASC

  def show
    @category = Category.find(params[:id])
    @articles = @category.articles.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY created_at DESC  [["category_id", 3]]
SELECT "categories".* FROM "categories"

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "priority", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Gnoseology"], ["priority", 1], ["created_at", "2021-05-26 20:02:40.278958"], ["updated_at", "2021-05-26 20:02:40.278958"]]