app/controllers/votes_controller.rb

SELECT 1 AS one FROM "votes" WHERE "votes"."article_id" = ? AND "votes"."user_id" = ? LIMIT ?  [["article_id", 7], ["user_id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["article_id", 2], ["created_at", "2021-05-27 19:58:55.040583"], ["updated_at", "2021-05-27 19:58:55.040583"]]
---
  def create
    @vote = Vote.new(user_id: session[:user_id], article_id: params[:article_id])
    if (!Vote.exists?(:article_id => @vote.article_id, :user_id => @vote.user_id))
      @vote.save