app/views/categories/index.html.erb

<div class="d-flex flex-row">
  <% categories = Category.includes(:most_recent_article).all%>
---
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY "articles"."created_at" DESC LIMIT ?  [["category_id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"