app/views/categories/show.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY created_at DESC  [["category_id", 2]]
---
<p>view of categories/show</p>
  <% @category.articles.order('created_at DESC').each do |article|%>